In [1]:
print('h')

h

In [2]:
import pymysql as p
print('done')

done

In [3]:
pip install PyMySQL

Collecting PyMySQL
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pymysql as p
print('done')

done

In [4]:
conn=p.connect(user = 'root',
           password='gaurav,,',
           autocommit = True)
print('connection created successfully!!')

connection created successfully!!

In [5]:
cur = conn.cursor()
print('done')

done

In [6]:
query='''create database IITM_day5;'''
cur.execute(query)
print('done')

done

In [7]:
query='''use IITM_day5;'''
cur.execute(query)
print('done')

done

In [8]:
query='''create table student_detail(std int not null,student_name varchar(50),course varchar(30),address varchar(50),scholarship float);'''

cur.execute(query)
print('done')

done

In [11]:
query=''' insert into student_detail values(102,"rahul dhamija","bba","delhi janakpuri",50000);'''
                                            
cur.execute(query)
print('done')

done

In [ ]:
for i in range(0,3,1):
    sid=int(input("enter your roll"))
    name=input("enter your name")
    course=input("enter your course")
    address=input("enter your address")
    scholarship=float(input("enter your scholarship:"))
    q=f''' insert into student_detail values
    ({sid},"{name}","{course}","{address}",{scholarship});''' 
    cur.execute(q)
    print("record inserted successfully")
print('done')

In [25]:
query='''select * from student_detail;'''
cur.execute(query)

record=cur.fetchall()
all_columns=[]
for i in cur.description:
    all_columns.append(i[0])
import pandas as pd
pd.DataFrame(record,columns=all_columns)

   std    student_name course          address  scholarship
0  101  gaurav dhamija    bca  delhi janakpuri      50000.0
1  102   rahul dhamija    bba  delhi janakpuri      50000.0
2  101          gaurav    bba        mu block        2000.0
3  101          gaurav    bba               mu       3000.0
4  102             ram    bca     keshav puram       4000.0
5  103            prem   bcom    kanhiya nagar       5000.0

In [22]:

print(all_columns)

['std', 'student_name', 'course', 'address', 'scholarship']

In [26]:

def show_records(db,table):
    query=f'''select * from {db}.{table};'''
    cur.execute(query)
    
    record=cur.fetchall()
    all_columns=[]
    for i in cur.description:
        all_columns.append(i[0])
    import pandas as pd
    df=pd.DataFrame(record,columns=all_columns)
    return df

In [29]:
show_records('iitm_day5','student_detail')

   std    student_name course          address  scholarship
0  101  gaurav dhamija    bca  delhi janakpuri      50000.0
1  102   rahul dhamija    bba  delhi janakpuri      50000.0
2  101          gaurav    bba        mu block        2000.0
3  101          gaurav    bba               mu       3000.0
4  102             ram    bca     keshav puram       4000.0
5  103            prem   bcom    kanhiya nagar       5000.0